Autodesk.Revit.DB.DatumExtentType
Represents the type of datum extent that is displayed in a particular view.
Since:
2016

Autodesk.Revit.DB.DatumExtentType.ViewSpecific
The extent displayed is specific to the view and does not represent the actual 3D extent of the datum plane.

Autodesk.Revit.DB.DatumExtentType.Model
The extent represents the actual 3D extent of the datum plane.